# ExportLayerKey Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLayerKey Constructor
ExportLayerKey Class See Also
---
Constructs a new ExportLayerKey with default values.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ExportLayerKey()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ExportLayerKey()
```

# See Also
ExportLayerKey Class
ExportLayerKey Overload
Autodesk.Revit.DB Namespace